app/controllers/operations_controller.rb

SELECT "operations".* FROM "operations"
---
  def index
    @operations = Operation.all

INSERT INTO "operations" ("amount", "odate", "description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @operation = Operation.new(operation_params)

    respond_to do |format|
      if @operation.save

UPDATE "operations" SET "odate" = ?, "updated_at" = ? WHERE "operations"."id" = ?  [["odate", "2023-07-22 00:00:00"], ["updated_at", "2023-07-12 22:04:45.020796"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @operation.update(operation_params)

SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
---
    def set_operation
      # @operation = @category.operations.find(params[:id])
       @operation = Operation.find(params[:id])