app/controllers/reports_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "operations".* FROM "operations" WHERE "operations"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = ?  [["category_id", 13]]
SELECT SUM("operations"."amount") FROM "operations" WHERE "operations"."category_id" = ?  [["category_id", 4]]
SELECT sum(karma) as count, strftime( "%Y-%m-%d 00:00:00 UTC", created_at ) as date_slice FROM "operations" WHERE "operations"."created_at" IS NOT NULL GROUP BY date_slice ORDER BY date_slice
SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = ?  [["category_id", 4]]
---
  def report_by_category
    @data = params

  @category = Category.find(params[:category_id])
  @operation = Operation.where("category_id": @category.id)
  @total = @operation.sum(:amount)

  @dataArr = @operation.map{|el| [el.amount.to_i, el.description ]}

SELECT sum(karma) as count, strftime( "%Y-%m-%d 00:00:00 UTC", created_at ) as date_slice FROM "operations" WHERE "operations"."created_at" IS NOT NULL GROUP BY date_slice ORDER BY date_slice
---
  def report_by_dates
    @data = params
    # @operations = Operation.all
    @days= (params[:start_date]..params[:end_date])

   @groups = Operation.where( [...@days].include?(:created_at) ).group_by_day