app/views/categories/_category.html.erb


  <% if category.operations.present? %>
---
SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = ?  [["category_id", 12]]

   <tbody
      <% category.operations.each do |operation| %>
---
SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = ?  [["category_id", 3]]