app/views/reports/index.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="form-group">
<% categories_array = Category.all.map { |c| [c.name, c.id] } %>