app/views/reports/report_by_category.html.erb

SELECT "operations".* FROM "operations" WHERE "operations"."category_id" = ?  [["category_id", 4]]
---
   <tbody
      <% @category.operations.each do |operation| %>